Repository: lihongxu0221/Toolkit
Catalog: Toolkit/BgCommon.Localization/Assets/Localization/Translations.*.resx
Languages: vi, zh_tw

# 权限不足：无法操作权限等级高于或等于自己的角色。
source: Insufficient permission: Cannot operate roles with permission levels higher than or equal to oneself.
vi: Không đủ quyền hạn: Không thể hoạt động với vai trò có cấp quyền cao hơn hoặc bằng chính mình.
zh_tw: 許可權不足：無法操作許可權等級高於或等於自己的角色。

# 权限不足：无法将角色权限等级提升到高于自己的最高等级。
source: Insufficient permissions: Unable to elevate the role permission level to a higher level than oneself.
vi: Không đủ quyền hạn: Không có cách nào để nâng cấp quyền hạn của nhân vật lên mức cao nhất so với chính mình.
zh_tw: 許可權不足：無法將角色許可權等級提升到高於自己的最高等級。

# 获取角色列表成功
source: Successfully obtained the list of roles
vi: Nhận danh sách vai trò thành công
zh_tw: 獲取角色清單成功

# 获取角色列表失败: {ErrorMessage}
source: Failed to retrieve the list of roles: {Error Message}
vi: Nhận danh sách nhân vật thất bại: {ErrorMessage}
zh_tw: 獲取角色清單失敗：{ErrorMessage}

# 获取用户角色信息成功
source: Successfully obtained user role information
vi: Nhận thông tin vai trò người dùng thành công
zh_tw: 獲取用戶角色資訊成功

# 获取用户角色信息时出错: {ErrorMessage}
source: Error occurred while obtaining user role information: {Error Message}
vi: Lỗi lấy thông tin vai trò người dùng: {ErrorMessage}
zh_tw: 獲取用戶角色資訊時出錯：{ErrorMessage}

# 角色 '{RoleName}' 已存在。
source: The role '{RoleName}' already exists.
vi: Nhân vật'{RoleName}'đã tồn tại.
zh_tw: 角色'{RoleName}'已存在。

# 角色 '{RoleName}' 添加成功。
source: Role '{RoleName}' added successfully.
vi: Nhân vật'{RoleName}'thêm thành công.
zh_tw: 角色'{RoleName}'添加成功。

# 指定Id({RoleId})的角色不存在。
source: The role with the specified ID ({RoleId}) does not exist.
vi: Vai trò xác định Id({RoleId}) không tồn tại.
zh_tw: 指定Id（{RoleId}）的角色不存在。

# 角色 '{RoleName}' 的信息已更新。
source: The information for role '{RoleName}' has been updated.
vi: Thông tin về nhân vật'{RoleName}'đã được cập nhật.
zh_tw: 角色'{RoleName}'的資訊已更新。

# 无法删除角色 '{RoleName}'，因为它已被分配给一个或多个用户。
source: The role '{RoleName}' cannot be deleted because it has already been assigned to one or more users.
vi: Vai trò'{RoleName}'không thể bị xóa vì nó đã được gán cho một hoặc nhiều người dùng.
zh_tw: 無法删除角色'{RoleName}'，因為它已被分配給一個或多個用戶。

# 角色 '{RoleName}' (ID: {RoleId}) 已删除。
source: The role '{RoleName}' (ID: {RoleId}) has been deleted.
vi: Nhân vật'{RoleName}'(ID:{RoleId}) đã bị xóa.
zh_tw: 角色'{RoleName}'（ID: {RoleId}）已删除。

# 模块 '{ModuleCode}' 不存在，无法查看参数
source: Module '{ModulaCode}' does not exist, unable to view parameters
vi: Mô-đun'{ModuleCode}'không tồn tại và không thể xem tham số
zh_tw: 模塊'{ModuleCode}'不存在，無法查看參數

# 获取参数列表成功
source: Successfully obtained parameter list
vi: Lấy danh sách tham số thành công
zh_tw: 獲取參數列表成功

# 参数编码 '{ModuleCode}' 在指定模块下已存在。
source: The parameter encoding '{Modulus Code}' already exists under the specified module.
vi: Mã hóa tham số'{ModuleCode}'đã tồn tại trong mô-đun được chỉ định.
zh_tw: 參數編碼'{ModuleCode}'在指定模塊下已存在。

# 创建了新参数 '{ParameterName}'.
source: Created a new parameter '{ParameterName}'
vi: Tạo tham số mới'{ParameterName}'.
zh_tw: 創建了新參數'{ParameterName}'.

# 参数创建失败: {ErrorMessage}
source: Parameter creation failed: {Error Message}
vi: Lỗi tạo tham số: {ErrorMessage}
zh_tw: 參數創建失敗：{ErrorMessage}

# 参数编码 '{ModuleCode}' 在指定模块下已被另一个参数使用。
source: The parameter encoding '{Modulus Code}' has already been used by another parameter in the specified module.
vi: Mã hóa tham số'{ModuleCode}'đã được sử dụng bởi một tham số khác theo mô-đun được chỉ định.
zh_tw: 參數編碼'{ModuleCode}'在指定模塊下已被另一個參數使用。

# 参数不存在
source: Parameter does not exist
vi: Tham số không tồn tại
zh_tw: 參數不存在

# 更新参数 '{ParameterName}' 旧值：{OldValue}, 新值：{NewValue}.
source: Update parameter '{ParameterName}' old value: {OldValue}, new value: {NewValue}
vi: Cập nhật tham số'{ParameterName}'giá trị cũ: {OldValue}, giá trị mới: {NewValue}.
zh_tw: 更新參數'{ParameterName}'舊值：{OldValue}，新值：{NewValue}.

# 参数更新失败: {ErrorMessage}
source: Parameter update failed: {Error Message}
vi: Cập nhật tham số không thành công: {ErrorMessage}
zh_tw: 參數更新失敗：{ErrorMessage}

# 参数 '{ParameterName}'成功删除.
source: Parameter '{ParameterName}' was successfully deleted
vi: Tham số'{ParameterName}'đã được xóa thành công.
zh_tw: 參數'{ParameterName}'成功删除.

# 参数删除失败: {ErrorMessage}
source: Parameter deletion failed: {Error Message}
vi: Lỗi xóa tham số: {ErrorMessage}
zh_tw: 參數删除失敗：{ErrorMessage}

# 没有需要处理的参数
source: There are no parameters that need to be processed
vi: Không có tham số để xử lý
zh_tw: 沒有需要處理的參數

# 参数编码不能为空。
source: Parameter encoding cannot be empty.
vi: Mã hóa tham số không thể để trống.
zh_tw: 參數編碼不能為空。

# 批处理请求中发现重复的参数组合 (编码='{ModuleCode}', 模块ID='{ModuleId}')。
source: Duplicate parameter combinations were found in batch requests (encoding='{Modulus Code}', module ID='{Modulus Id}').
vi: Sự kết hợp lặp đi lặp lại của các tham số được tìm thấy trong các yêu cầu batch (mã hóa='{ModuleCode}', và ID module='{ModuleId}').
zh_tw: 批次處理請求中發現重複的參數組合（編碼='{ModuleCode}'，模塊ID='{ModuleId}'）。

# 尝试更新的参数ID '{ParameterId}' 在数据库中不存在。
source: The parameter ID '{ParameterId}' attempted to update does not exist in the database.
vi: ID tham số'{ParameterId}'đang cố gắng cập nhật không tồn tại trong cơ sở dữ liệu.
zh_tw: 嘗試更新的參數ID '{ParameterId}'在資料庫中不存在。

source: Parameter ID '{ParameterId}' matched successfully, but the combination in its database (encoding='{ModulaCode}', module ID='{ModulaId}') does not match the one you provided.
vi: ID tham số'{ParameterId}'khớp thành công, nhưng sự kết hợp trong cơ sở dữ liệu của nó (mã hóa='{ModuleCode}' và ID mô-đun='{ModuleId}') không khớp với những gì bạn cung cấp.
zh_tw: 參數ID '{ParameterId}'匹配成功，但其資料庫中的組合（編碼='{ModuleCode}'，模塊ID='{ModuleId}'）與您提供的不符。

# 参数组合 (编码='{ModuleCode}', 模块ID='{ModuleId}') 已存在，无法新增。
source: The parameter combination (encoding='{Modulus Code}', module ID='{Modulus Id}') already exists and cannot be added.
vi: Các tổ hợp tham số (mã hóa='{ModuleCode}', ID module='{ModuleId}') đã tồn tại và không thể thêm vào.
zh_tw: 參數組合（編碼='{ModuleCode}'，模塊ID='{ModuleId}'）已存在，無法新增。

# 数据保存失败: {ErrorMessage}
source: Data save failed: {Error Message}
vi: Lỗi lưu dữ liệu: {ErrorMessage}
zh_tw: 數據保存失敗：{ErrorMessage}

source: Batch processing completed. Added {AddedCount}, updated {Updating Count}, skipped {SkippedCount}, and failed {Failed Count}.
vi: Xử lý hàng loạt hoàn tất. Thêm {AddedCount}, cập nhật {UpdatedCount}, bỏ qua {SkippedCount} và thất bại {FailedCount}.
zh_tw: 批量處理完成。 新增{AddedCount}個，更新{UpdatedCount}個，跳過{SkippedCount}個，失敗{FailedCount}個。

# 指定的参数的约束不存在
source: The constraint of the specified parameter does not exist
vi: Các ràng buộc cho các đối số đã xác định không tồn tại
zh_tw: 指定的參數的約束不存在

# 参数约束获取成功
source: Parameter constraint obtained successfully
vi: Parameter Constraint Thành công
zh_tw: 參數約束獲取成功

# 参数约束获取时发生错误: {ErrorMessage}
source: Error occurred while obtaining parameter constraint: {Error Message}
vi: Lỗi xảy ra khi thu thập các ràng buộc tham số: {ErrorMessage}
zh_tw: 參數約束獲取時發生錯誤：{ErrorMessage}

# 无法添加约束，因为所属的参数不存在
source: Cannot add constraint because the parameter it belongs to does not exist
vi: Không thể thêm ràng buộc vì đối số thuộc về không tồn tại
zh_tw: 無法添加約束，因為所屬的參數不存在

# 约束添加成功:参数ID '{ParameterId}' 添加了约束 '{ConstraintType}'.
source: Constraint added successfully: Parameter ID '{ParameterId}' added constraint '{ConstraintType}'
vi: Tham số ID'{ParameterId}'đã thêm ràng buộc'{ConstraintType}'.
zh_tw: 約束添加成功：參數ID '{ParameterId}'添加了約束'{ConstraintType}'.

# 约束添加失败: {ErrorMessage}
source: Constraint addition failed: {Error Message}
vi: Thêm ràng buộc không thành công: {ErrorMessage}
zh_tw: 約束添加失敗：{ErrorMessage}

# 约束更新成功: 参数ID '{ParameterId}' 的约束 '{ConstraintType}'.
source: Constraint update successful: Constraint '{ConstraintType}' for parameter ID '{ParameterId}'
vi: Hạn chế cập nhật thành công: Hạn chế của ID tham số'{ParameterId}'{ConstraintType}'.
zh_tw: 約束更新成功：參數ID '{ParameterId}'的約束'{ConstraintType}'.

# 约束更新失败: {ErrorMessage}
source: Constraint update failed: {Error Message}
vi: Cập nhật ràng buộc không thành công: {ErrorMessage}
zh_tw: 約束更新失敗：{ErrorMessage}

# 约束不存在
source: Constraint does not exist
vi: Constraint không tồn tại
zh_tw: 約束不存在

# 约束删除成功 : 参数ID '{ParameterId}' 的约束 '{ConstraintType}'.
source: Constraint deleted successfully: Constraint '{ConstraintType}' for parameter ID '{ParameterId}'
vi: Xóa ràng buộc thành công: ràng buộc của ID tham số'{ParameterId}'{ConstraintType}'.
zh_tw: 約束删除成功：參數ID '{ParameterId}'的約束'{ConstraintType}'.

# 约束删除失败: {ErrorMessage}
source: Constraint deletion failed: {Error Message}
vi: Lỗi xóa ràng buộc: {ErrorMessage}
zh_tw: 約束删除失敗：{ErrorMessage}

# 当前用户信息不能为空，无法查看参数
source: The current user information cannot be empty, and parameters cannot be viewed
vi: Thông tin người dùng hiện tại không thể để trống, không thể xem tham số
zh_tw: 當前用戶資訊不能為空，無法查看參數

# 用户没有任何角色，无法查看参数
source: The user has no role and cannot view parameters
vi: Người dùng không có vai trò và không thể xem các tham số
zh_tw: 用戶沒有任何角色，無法查看參數

# 获取用户可见参数时发生错误。
source: An error occurred while obtaining visible parameters for the user.
vi: Đã xảy ra lỗi khi lấy tham số hiển thị của người dùng.
zh_tw: 獲取用戶可見參數時發生錯誤。

# 获取用户可见参数时发生错误: {ErrorMessage}
source: Error occurred while obtaining user visible parameters: {Error Message}
vi: Đã xảy ra lỗi khi lấy tham số hiển thị của người dùng: {ErrorMessage}
zh_tw: 獲取用戶可見參數時發生錯誤：{ErrorMessage}

# 指定的引用对象 (类型: {RefObjectType}, ID: {RefObjectId}) 不存在。
source: The specified reference object (type: {RefObject Type}, ID: {RefObject Id}) does not exist.
vi: Đối tượng tham chiếu được chỉ định (kiểu: {RefObjectType}, ID: {RefObjectId}) không tồn tại.
zh_tw: 指定的引用對象（類型：{RefObjectType}，ID: {RefObjectId}）不存在。

# 用户未配置直接权限，应使用角色权限
source: The user has not configured direct permissions and should use role permissions
vi: Người dùng không được cấu hình quyền trực tiếp và nên sử dụng quyền vai trò
zh_tw: 用戶未配寘直接許可權，應使用角色許可權

# 获取直接授权的模块ID成功
source: Successfully obtained module ID for direct authorization
vi: Nhận ID mô-đun được ủy quyền trực tiếp Thành công
zh_tw: 獲取直接授權的模塊ID成功

# 获取直接授权信息时出错: {Message}
source: Error occurred while obtaining direct authorization information: {Message}
vi: Lỗi khi lấy thông tin ủy quyền trực tiếp: {Message}
zh_tw: 獲取直接授權資訊時出錯：{Message}

# 要授权的用户不存在。
source: The user to be authorized does not exist.
vi: Người dùng được ủy quyền không tồn tại.
zh_tw: 要授權的用戶不存在。

# 该用户已拥有此权限，无法重复授予。
source: The user already has this permission and cannot be granted again.
vi: Người dùng đã có quyền này và không thể cấp lại.
zh_tw: 該用戶已擁有此許可權，無法重複授予。

# 权限授予成功
source: Permission granted successfully
vi: Cấp quyền thành công
zh_tw: 許可權授予成功

# 授予用户ID '{UserId}' 对对象 '{RefObjectType}:{RefObjectId}' 的访问权限
source: Grant user ID '{UserId}' access to object '{RefObject Type}: {RefObject Id}'
vi: Cho phép ID người dùng'{UserId}'truy cập vào đối tượng'{RefObjectType}:{RefObjectId}'
zh_tw: 授予用戶ID '{UserId}'對對象'{RefObjectType}：{RefObjectId}'的存取權限

# 授予权限时发生错误: {ErrorMessage}
source: Error occurred while granting permissions: {Error Message}
vi: Đã xảy ra lỗi khi cấp quyền: {ErrorMessage}
zh_tw: 授予許可權時發生錯誤：{ErrorMessage}

# 要撤销的权限记录不存在
source: The permission record to be revoked does not exist
vi: Bản ghi quyền để thu hồi không tồn tại
zh_tw: 要撤銷的許可權記錄不存在

# 撤销了用户ID '{UserId}' 对对象 '{RefObjType}:{RefObjId}' 的访问权限 (记录ID: {AccessRightId})
source: Revoked the access permission of user ID '{UserId}' to object '{RefObjType}: {RefObjId}' (record ID: {AccessRightId})
vi: Thu hồi quyền truy cập của ID người dùng'{UserId}'vào đối tượng'{RefObjType}:{RefObjId}' (ID bản ghi: {AccessRightId})
zh_tw: 撤銷了用戶ID '{UserId}'對對象'{RefObjType}：{RefObjId}'的存取權限（記錄ID: {AccessRightId}）

# 权限撤销成功
source: Permission revocation successful
vi: Thu hồi quyền thành công
zh_tw: 許可權撤銷成功

# 撤销权限时发生错误: {Message}
source: Error occurred while revoking permission: {Message}
vi: Lỗi xảy ra khi thu hồi quyền: {Message}
zh_tw: 撤銷許可權時發生錯誤：{Message}

# 获取用户权限列表成功
source: Successfully obtained user permission list
vi: Nhận danh sách quyền người dùng thành công
zh_tw: 獲取用戶許可權清單成功

# 获取用户权限列表时发生错误: {Message}
source: An error occurred while obtaining the user permission list: {Message}
vi: Đã xảy ra lỗi khi lấy danh sách quyền người dùng: {Message}
zh_tw: 獲取用戶許可權清單時發生錯誤：{Message}

# 用户拥有直接访问权限
source: The user has direct access permission
vi: Người dùng có quyền truy cập trực tiếp
zh_tw: 用戶擁有直接存取權限

# 用户没有直接访问权限
source: The user does not have direct access permission
vi: Người dùng không có quyền truy cập trực tiếp
zh_tw: 用戶沒有直接存取權限

# 检查访问权限时发生错误: {Message}
source: An error occurred while checking access permissions: {Message}
vi: Đã xảy ra lỗi khi kiểm tra quyền truy cập: {Message}
zh_tw: 檢查存取權限時發生錯誤：{Message}

# 没有需要处理的授权请求
source: There are no authorization requests that need to be processed
vi: Không có yêu cầu ủy quyền cần được xử lý
zh_tw: 沒有需要處理的授權請求

# 要授权的用户不存在
source: The user to be authorized does not exist
vi: Người dùng được ủy quyền không tồn tại
zh_tw: 要授權的用戶不存在

# 引用的对象 (类型: {RefObjectType}, ID: {RefObjectId}) 不存在
source: The referenced object (type: {RefObject Type}, ID: {RefObject Id}) does not exist
vi: Đối tượng tham chiếu (kiểu: {RefObjectType}, ID: {RefObjectId}) không tồn tại
zh_tw: 引用的對象（類型：{RefObjectType}，ID: {RefObjectId}）不存在

# 批量授权完成。成功 {SuccessCount} 个，跳过 {SkippedCount} 个，失败 {FailureCount} 个
source: Batch authorization completed. Successfully {SuccessCount}, skipped {SkippedCount}, failed {Failed Count}
vi: Ủy quyền số lượng lớn đã hoàn tất. Thành công {SuccessCount} một, bỏ qua {SkippedCount} một, thất bại {FailureCount} một
zh_tw: 批量授權完成。 成功{SuccessCount}個，跳過{SkippedCount}個，失敗{FailureCount}個

# 没有需要撤销的权限
source: There is no permission to revoke
vi: Không có quyền yêu cầu thu hồi
zh_tw: 沒有需要撤銷的許可權

# 根据提供的ID，未找到任何可撤销的权限记录
source: According to the provided ID, no revocable permission records were found
vi: Theo ID được cung cấp, không có bản ghi quyền hủy bỏ nào được tìm thấy
zh_tw: 根據提供的ID，未找到任何可撤銷的許可權記錄

# 批量撤销了 {Count} 条直接访问权限
source: Batch revoked {Count} direct access permissions
vi: Thu hồi hàng loạt {Count} quyền truy cập trực tiếp
zh_tw: 批量撤銷了{Count}條直接存取權限

# 批量权限撤销成功
source: Batch permission revocation successful
vi: Thu hồi quyền hàng loạt thành công
zh_tw: 批量許可權撤銷成功

# 批量撤销权限时发生错误: {Message}
source: An error occurred while revoking permissions in bulk: {Message}
vi: Lỗi xảy ra khi thu hồi quyền hàng loạt: {Message}
zh_tw: 批量撤銷許可權時發生錯誤：{Message}

# 读取/创建操作的数据权限校验默认通过
source: The data permission verification for read/create operations is passed by default
vi: Đọc/tạo hành động Kiểm tra quyền dữ liệu Mặc định Vượt qua
zh_tw: 讀取/創建操作的數據許可權校驗默認通過

# 无法删除自己
source: Unable to delete oneself
vi: Không thể xóa bản thân
zh_tw: 無法删除自己

# 允许修改自身信息
source: Allow modification of personal information
vi: Cho phép thay đổi thông tin của chính bạn
zh_tw: 允許修改自身資訊

# 未知的操作类型
source: Unknown operation type
vi: Kiểu hoạt động không rõ
zh_tw: 未知的操作類型

# 获取用户权限信息失败
source: Failed to obtain user permission information
vi: Lỗi lấy thông tin quyền người dùng
zh_tw: 獲取用戶許可權資訊失敗

# 权限不足：无法操作权限等级高于或等于自己的用户
source: Insufficient permissions: unable to operate users with permission levels higher than or equal to oneself
vi: Không đủ quyền: Không thể thao tác người dùng có cấp quyền cao hơn hoặc bằng chính họ
zh_tw: 許可權不足：無法操作許可權等級高於或等於自己的用戶

# 数据权限校验通过
source: Data permission verification passed
vi: Kiểm tra quyền dữ liệu Pass
zh_tw: 數據許可權校驗通過

# 数据权限校验时发生错误: {Message}
source: Error occurred during data permission verification: {Message}
vi: Lỗi xảy ra khi kiểm tra quyền dữ liệu: {Message}
zh_tw: 數據許可權校驗時發生錯誤：{Message}

# 无法获取操作员的权限信息
source: Unable to obtain operator's permission information
vi: Không thể lấy thông tin về quyền của nhà điều hành
zh_tw: 無法獲取操作員的許可權資訊

# 一个或多个待分配的角色不存在
source: One or more roles to be assigned do not exist
vi: Một hoặc nhiều vai trò được giao không tồn tại
zh_tw: 一個或多個待分配的角色不存在

# 权限不足：无法为用户分配权限等级高于自己的角色
source: Insufficient permissions: unable to assign a role with a higher level of permissions than oneself to the user
vi: Không đủ đặc quyền: Không thể gán cho người dùng vai trò có cấp quyền cao hơn họ
zh_tw: 許可權不足：無法為用戶分配許可權等級高於自己的角色

# 用户名 '{UserName}' 已存在
source: The username '{UserName}' already exists
vi: Tên người dùng'{UserName}'đã tồn tại
zh_tw: 用戶名'{UserName}'已存在

# 成功创建并配置了新用户 '{UserName}'
source: Successfully created and configured a new user '{UserName}'
vi: Người dùng mới đã được tạo và cấu hình thành công'{UserName}'
zh_tw: 成功創建並配寘了新用戶'{UserName}'

# 用户注册成功
source: User registration successful
vi: Đăng ký thành công
zh_tw: 用戶註冊成功

# 用户不存在
source: User does not exist
vi: Người dùng không tồn tại
zh_tw: 用戶不存在

# 更新了用户 '{UserName}' 的信息、角色和直接权限
source: Updated the information, roles, and direct permissions of user '{UserName}'
vi: Cập nhật thông tin, vai trò và quyền trực tiếp cho người dùng'{UserName}'
zh_tw: 更新了用戶'{UserName}'的資訊、角色和直接許可權

# 用户信息更新成功
source: User information updated successfully
vi: Cập nhật thông tin người dùng thành công
zh_tw: 用戶資訊更新成功

# 用户信息更新时发生错误: {Message}
source: An error occurred while updating user information: {Message}
vi: Lỗi xảy ra khi cập nhật thông tin người dùng: {Message}
zh_tw: 用戶資訊更新時發生錯誤：{Message}

# 注册失败: {Message}
source: Registration failed: {Message}
vi: Đăng ký thất bại: {Message}
zh_tw: 注册失敗：{Message}

# 更新了用户'{UserName}'的信息
source: Updated information for user '{UserName}'
vi: Cập nhật thông tin về người dùng'{UserName}'
zh_tw: 更新了用戶'{UserName}'的資訊

# 更新用户信息时发生错误: {Message}
source: An error occurred while updating user information: {Message}
vi: Đã xảy ra lỗi khi cập nhật thông tin người dùng: {Message}
zh_tw: 更新用戶資訊時發生錯誤：{Message}

# 用户删除成功
source: User deleted successfully
vi: Xóa người dùng thành công
zh_tw: 用戶删除成功

# 用户信息删除时发生错误: {Message}
source: Error occurred while deleting user information: {Message}
vi: Lỗi xảy ra khi xóa thông tin người dùng: {Message}
zh_tw: 用戶資訊删除時發生錯誤：{Message}

# 获取用户列表成功
source: Successfully obtained user list
vi: Nhận danh sách người dùng thành công
zh_tw: 獲取用戶列表成功

# 按角色获取用户列表成功
source: Successfully obtained user list by role
vi: Nhận danh sách người dùng theo vai trò Thành công
zh_tw: 按角色獲取用戶列表成功

# 按角色获取用户列表失败: {Message}
source: Failed to retrieve user list by role: {Message}
vi: Nhận danh sách người dùng theo vai trò không thành công: {Message}
zh_tw: 按角色獲取用戶列表失敗：{Message}

# 无法为用户分配权限等级高于自己的角色
source: Unable to assign roles with permission levels higher than oneself to users
vi: Không thể gán vai trò cho người dùng có cấp quyền cao hơn họ
zh_tw: 無法為用戶分配許可權等級高於自己的角色

# 用户角色分配成功
source: User role assignment successful
vi: Phân bổ vai trò người dùng thành công
zh_tw: 用戶角色分配成功

# 分配角色时发生错误: {Message}
source: An error occurred while assigning the role: {Message}
vi: Lỗi khi gán vai trò: {Message}
zh_tw: 分配角色時發生錯誤：{Message}

# 成功修改密码
source: Successfully changed password
vi: Thay đổi mật khẩu thành công
zh_tw: 成功修改密碼

# GlobalVarService不能为空!
source: GlobalVarService cannot be empty!
vi: GlobalVarService không thể để trống!
zh_tw: GlobalVarService不能為空！

# [框架初始化]
source: [Framework initialization]
vi: [Khởi tạo khung]
zh_tw: [框架初始化]

# 基础初始化完成...
source: Basic initialization completed ..
vi: Khởi tạo nền tảng hoàn tất. ..
zh_tw: 基礎初始化完成. ..

# 日志模块初始化完成，耗时 {Milliseconds} ms
source: Log module initialization completed, taking {Milliseconds} ms
vi: Việc khởi tạo mô-đun nhật ký hoàn tất, tốn thời gian {Milliseconds} ms
zh_tw: 日誌模塊初始化完成，耗時{Milliseconds} ms

# 注入数据库服务初始化完成，耗时 {Milliseconds} ms
source: Initialization of database service injection completed, taking {Milliseconds} ms
vi: Injection database service khởi tạo xong, tốn thời gian {Milliseconds} ms
zh_tw: 注入資料庫服務初始化完成，耗時{Milliseconds} ms

# InitialServiceType 不能为空，且必须从InitializationServiceBase派生!
source: InitialServiceType cannot be empty and must be derived from InitialationServiceBase!
vi: InitialServiceType không thể để trống và phải được dẫn xuất từ InitialServiceBase!
zh_tw: InitialServiceType不能為空，且必須從InitializationServiceBase派生！

# 基础模块初始化完成，耗时 {Milliseconds} ms
source: Basic module initialization completed, taking {Milliseconds} ms
vi: Khởi tạo module cơ bản hoàn tất, tốn thời gian {Milliseconds} ms
zh_tw: 基礎模塊初始化完成，耗時{Milliseconds} ms

# 模块 {ModuleName} 加载完成。。。。。。
source: Module {ModulaName} loading completed......
vi: Name
zh_tw: 模塊{ModuleName}加載完成。。。。。。

# 参数
source: Parameter
vi: tham số
zh_tw: 參數

# 系统警告
source: System Warning
vi: Cảnh báo hệ thống
zh_tw: 系統警告

# 系统提示
source: System Prompt
vi: Mẹo hệ thống
zh_tw: 系統提示

# 密码不允许为空
source: Password cannot be empty
vi: Mật khẩu không được phép để trống
zh_tw: 密碼不允許為空

# 俩次输入的密码不一致
source: The passwords entered twice do not match
vi: Hai lần nhập mật khẩu không đồng nhất
zh_tw: 倆次輸入的密碼不一致

# 【{UserName}】登录需要密码确认
source: [{UserName}] Login requires password confirmation
vi: [{UserName}] Đăng nhập cần xác nhận mật khẩu
zh_tw: 【{UserName}】登入需要密碼確認

# 没有选择任何程序集
source: No assembly selected
vi: Không có assembly nào được chọn
zh_tw: 沒有選擇任何程式集

# 请先选择要加载的程序集文件.
source: Please select the assembly file to load first
vi: Vui lòng chọn tập tin assembly bạn muốn tải trước.
zh_tw: 請先選擇要加載的程式集檔案.

# 没有在选中的程序集文件中找到任何插件.
source: No plugins were found in the selected assembly file
vi: Không tìm thấy plugin nào trong tập tin assembly đã chọn.
zh_tw: 沒有在選中的程式集檔案中找到任何挿件.

# 程序集文件 (*.dll, *.exe)
source: Assembly files (*. dll, *. exe)
vi: Tập tin assembly (*.dll, *.exe)
zh_tw: 程式集檔案（*.dll，*.exe）

# 程序集文件 (*.dll)
source: Assembly files (*. dll)
vi: Tập tin assembly (*.dll)
zh_tw: 程式集檔案（*.dll）

# 程序集文件 (*.exe)
source: Assembly Files (*. exe)
vi: Tập tin assembly (*.exe)
zh_tw: 程式集檔案（*.exe）

# 选择程序集文件
source: Select assembly file
vi: Chọn tập tin assembly
zh_tw: 選擇程式集檔案

# 扫描完成，共找到 {Count} 个程序集
source: Scan completed, found {Count} assemblies in total
vi: Quét xong, tìm thấy tổng cộng {Count} assembly
zh_tw: 掃描完成，共找到{Count}個程式集

# 扫描已由用户取消
source: The scan has been canceled by the user
vi: Quét đã bị hủy bởi người dùng
zh_tw: 掃描已由用戶取消

# 扫描时发生错误: {Message}
source: Error occurred during scanning: {Message}
vi: Lỗi xảy ra khi quét: {Message}
zh_tw: 掃描時發生錯誤：{Message}

# 用户取消登陆
source: User cancels login
vi: Người dùng hủy đăng nhập
zh_tw: 用戶取消登入

# 用户名或密码不能为空
source: Username or password cannot be empty
vi: Tên người dùng hoặc mật khẩu không được để trống
zh_tw: 用戶名或密碼不能為空

# 日志数据配置界面
source: Log data configuration interface
vi: Giao diện cấu hình dữ liệu nhật ký
zh_tw: 日誌數據配寘介面

# 状态初始化完成。请查看日志源
source: State initialization completed. Please check the log source
vi: Khởi tạo trạng thái hoàn tất. Vui lòng xem nguồn log
zh_tw: 狀態初始化完成。 請查看日誌源

# 日志配置已更改，正在重新加载显示设置
source: The log configuration has been changed and the display settings are being reloaded
vi: Cấu hình nhật ký đã thay đổi, cài đặt hiển thị đang được tải lại
zh_tw: 日誌配寘已更改，正在重新加載顯示設定

# 模块名称不能为空
source: Module name cannot be empty
vi: Tên module không được để trống
zh_tw: 模塊名稱不能為空

# 默认模块不能被删除
source: The default module cannot be deleted
vi: Mô-đun mặc định không thể bị xóa
zh_tw: 默認模塊不能被删除

# 模块参数配置
source: Module parameter configuration
vi: Cấu hình tham số mô-đun
zh_tw: 模塊參數配寘

# 视图：{ModuleCode} 配置不正确，请联系管理人员
source: View: {Modulus Code} configuration incorrect, please contact management personnel
vi: View: {ModuleCode} được cấu hình không chính xác, vui lòng liên hệ với quản trị viên
zh_tw: 視圖：{ModuleCode}配寘不正確，請聯系管理人員

# 不能删除默认模块的操作权限
source: Cannot delete operation permissions for default modules
vi: Không thể xóa quyền hoạt động của mô-đun mặc định
zh_tw: 不能删除默認模塊的操作許可權

# 请先选中要删除的用户
source: Please select the user to be deleted first
vi: Vui lòng chọn người dùng bạn muốn xóa trước
zh_tw: 請先選中要删除的用戶

# 默认用户不允许删除
source: Default user not allowed to delete
vi: Người dùng mặc định không được phép xóa
zh_tw: 默認用戶不允許删除

# 操作已取消
source: Operation canceled
vi: Hành động bị hủy bỏ
zh_tw: 操作已取消

# 处理实体变更时发生意外错误
source: An unexpected error occurred while processing entity changes
vi: Lỗi bất ngờ xảy ra khi xử lý thay đổi thực thể
zh_tw: 處理實體變更時發生意外錯誤
