Repository: lihongxu0221/Toolkit
Catalog: Toolkit/BgCommon.Localization/Assets/Localization/Translations.*.resx
Languages: vi, zh_tw

source: About
zh_tw: 关于

source: Cancel
zh_tw: 取消

source: Clear alarm
zh_tw: 清除报警

source: Confirm
zh_tw: 确定

source: Done
zh_tw: 完成

source: Full screen
zh_tw: 全屏

source: General
zh_tw: 通用

source: Home
zh_tw: 主页

source: Language
zh_tw: 语言

source: Login
zh_tw: 登陆

# LoginFailed
source: The username or password is incorrect. Login failed!
zh_tw: 用户名或密码不正确，登陆失败！

source: New
zh_tw: 新建

source: Open
zh_tw: 打开

source: Password
zh_tw: 密码

source: Pause
zh_tw: 暂停

source: Project
vi: 项目
zh_tw: 项目

source: Reset
zh_tw: 复位

source: Save
zh_tw: 保存

source: Save as
zh_tw: 另存为

source: Setting
zh_tw: 设置

source: Start
zh_tw: 启动

source: Stop
zh_tw: 停止

source: User login
zh_tw: 用户登陆

source: User name
zh_tw: 用户名

# UserNameOrPasswordIsEmpty
source: The username and password are not allowed to be empty!
zh_tw: 用户名和密码不允许为空！

source: Cover image
zh_tw: 封面图像

source: Create time
zh_tw: 创建时间

source: File path
zh_tw: 路径

source: File size
zh_tw: 文件大小

source: Import
zh_tw: 导入

source: Modify time
zh_tw: 修改时间

# ProjectInfo
source: Project information
zh_tw: 项目信息

source: Project name
zh_tw: 项目名称

# ProjectPath
source: Projectt path
zh_tw: 项目路径

# QuickAction
source: Quick Actions
zh_tw: 快速操作

source: Untitled
zh_tw: 未命名

source: Remark
zh_tw: 备注

source: Machine
zh_tw: 机器

source: Track parameter
zh_tw: 轨道参数

source: Track width
zh_tw: 轨道宽度

# TrackClamping
source: Clamping amount
zh_tw: 夹紧量

source: Board width
zh_tw: 板宽

source: Board height
zh_tw: 板高

source: Modify
zh_tw: 修改

source: Error prompt
zh_tw: 错误提示

# ProjectSaveError
source: Failed to save the project. Reason: {Reason}{NewLine}
vi: Lưu dự án thất bại. Lý do: {Reason}{NewLine}
zh_tw: 專案儲存失敗。原因：{Reason}{NewLine}

source: Local
zh_tw: 本地

source: No
zh_tw: 否

source: Yes
zh_tw: 是

source: System warning
zh_tw: 系统警告

source: System prompt
zh_tw: 系统提示

source: Delete
zh_tw: 删除

source: Display
zh_tw: 显示

source: Output
zh_tw: 输出

source: Input
zh_tw: 输入

source: LimitZ
zh_tw: 限制Z

# Index
source: Seq.
zh_tw: 序号

# ToolName
source: Tool
zh_tw: 工具

source: Connect
zh_tw: 连接

# DisConnect
source: DisConnnect
zh_tw: 断开连接

# TypeNotEnum
source: The type {TypeName} is not an enumeration.
vi: Kiểu {TypeName} không phải là kiểu liệt kê.
zh_tw: 類型 {TypeName} 不是列舉類型。

source: Copy to clipboard
zh_tw: 复制到剪贴板

# 请输入
source: Please input
zh_tw: 请输入

source: Parameter
zh_tw: 参数

source: Close
zh_tw: 关闭

source: Delete all
zh_tw: 删除所有

# BaseSetting
source: Basic settings
zh_tw: 基础设置

source: Execute
zh_tw: 运行

source: Work station
zh_tw: 工位

# 操作员
source: Operator
vi: Nhân viên vận hành
zh_tw: 操作員

# 工程师
source: Engineer
vi: Kỹ sư
zh_tw: 工程师

# 管理员
source: Administrator
vi: Quản trị viên
zh_tw: 管理員

# 最大值
source: Maxinum
vi: Tối đa
zh_tw: 最大值

# 最小值
source: Mininum
vi: Tối thiểu
zh_tw: 最小值

# 集合控件
source: Collection control
vi: Bộ điều khiển tập hợp
zh_tw: 集合控制項

# 确定
source: OK
vi: Đồng ý
zh_tw: 確定

# 取消
source: Cancel
vi: Hủy
zh_tw: 取消

# 用户权限
source: User permissions
vi: Quyền hạn người dùng
zh_tw: 用戶權限

# 用户名
source: Name
vi: Tên người dùng
zh_tw: 使用者名稱

# 密码
source: Password
vi: Mật khẩu
zh_tw: 密碼

# 自动登录
source: Auto login
vi: Đăng nhập tự động
zh_tw: 自動登入

# 记住密码
source: Remember
vi: Ghi nhớ mật khẩu
zh_tw: 記住密碼

# 登陆
source: Login
vi: Đăng nhập
zh_tw: 登入

# 切换用户
source: Switch User
vi: Chuyển đổi người dùng
zh_tw: 切換使用者

# 用户登陆
source: User login
vi: Người dùng đăng nhập
zh_tw: 使用者登入

# 系统维护
source: System maintenance
vi: bảo trì hệ thống
zh_tw: 系統維護

# 用户管理
source: User
vi: Quản lý người dùng
zh_tw: 用戶管理

# 角色管理
source: Role
vi: Quản lý vai trò
zh_tw: 角色管理

# 模块管理
source: Module
vi: Quản lý mô-đun
zh_tw: 模塊管理

# 参数管理
source: Parameter
vi: Quản lý tham số
zh_tw: 參數管理

# 操作权限
source: Operation permissions
vi: Quyền hoạt động
zh_tw: 操作許可權

# 用户ID
source: ID
vi: ID người dùng
zh_tw: 用戶ID

# 已启用
source: Enabled
vi: đã bật
zh_tw: 已啟用

# 在线
source: Online
vi: trực tuyến
zh_tw: 線上

# 权限
source: Permission
vi: Quyền hạn
zh_tw: 權限

# 新增用户
source: New
vi: Người dùng mới
zh_tw: 新增用戶

# 修改用户
source: Modify
vi: sửa đổi người dùng
zh_tw: 修改用戶

# 删除用户
source: Delete
vi: xóa người dùng
zh_tw: 删除用戶

# 刷新
source: Refresh
vi: làm mới
zh_tw: 刷新

# 导入模块
source: Import
vi: Mô- đun nhập
zh_tw: 導入模塊

# 新增模块
source: New
vi: Module mới
zh_tw: 新增模塊

# 序号
source: NO.
vi: số thứ tự
zh_tw: 序號

# 菜单名称
source: Menu name
vi: Tên thực đơn
zh_tw: 選單名稱

# 排序
source: Sort
vi: Sắp xếp
zh_tw: 排序

# 图标
source: Icon
vi: Biểu tượng
zh_tw: 圖標

# 操作
source: Operation
vi: thao tác
zh_tw: 操作

# 新增参数
source: New
vi: Tham số mới
zh_tw: 新增參數

# 修改参数
source: Modify
vi: Sửa đổi tham số
zh_tw: 修改參數

# 删除参数
source: Delete
vi: Xoá tham số
zh_tw: 删除參數

# 约束管理
source: Constraint
vi: Quản lý ràng buộc
zh_tw: 約束管理

# 所属模块
source: Module
vi: Module sở hữu
zh_tw: 所屬模塊

# 参数分组
source: Grouping
vi: Nhóm tham số
zh_tw: 參數分組

# 参数名称
source: Name
vi: Tên tham số
zh_tw: 參數名稱

# 操作名称
source: Name
vi: Hành động
zh_tw: 操作名稱

# 操作编码
source: Operation code
vi: Mã hóa hoạt động
zh_tw: 操作編碼

# 备注
source: Remark
vi: Ghi chú
zh_tw: 備註

# 新增操作
source: New
vi: Hành động mới
zh_tw: 新增操作

# 修改操作
source: Modify
vi: Sửa đổi hành động
zh_tw: 修改操作

# 删除操作
source: Delete
vi: Xoá hành động
zh_tw: 删除操作

# 是否启用
source: Enable
vi: Bật hay không
zh_tw: 是否啟用

# 清除
source: Clear
vi: xóa bỏ
zh_tw: 清除

# 添加子模块
source: Submodule
vi: Thêm mô-đun con
zh_tw: 添加子模塊

# 编辑
source: Edit
vi: biên tập
zh_tw: 編輯

# 更新模块信息
source: Update module information
vi: Cập nhật thông tin mô-đun
zh_tw: 更新模塊資訊

# 模块编号
source: Module Number
vi: Số mô-đun
zh_tw: 模塊編號

# 模块编码
source: Module coding
vi: Mã hóa mô-đun
zh_tw: 模塊編碼

# 模块名
source: Module name
vi: Mô- đun Name
zh_tw: 模塊名

# 父模块
source: Parent module
vi: Module cha
zh_tw: 父模塊

# 模块路径
source: Module Path
vi: Đường dẫn mô-đun
zh_tw: 模塊路徑

# 系统模块
source: System Module
vi: Mô đun hệ thống
zh_tw: 系統模塊

# 添加用户
source: New
vi: Thêm người dùng
zh_tw: 添加用戶

# 编辑用户
source: Edit user
vi: Sửa người dùng
zh_tw: 編輯用戶

# 账号
source: User name
vi: tài khoản
zh_tw: 帳號

# 基本信息
source: Basic information
vi: thông tin cơ bản
zh_tw: 基本資訊

# 访客
source: Guest
vi: khách tham quan
zh_tw: 訪客

# 修改操作权限
source: Modify operation permissions
vi: Sửa đổi quyền hành động
zh_tw: 修改操作許可權

# 新增操作权限
source: New operation permissions
vi: Thêm quyền hành động
zh_tw: 新增操作許可權

# 编码
source: Code
vi: Mã hóa
zh_tw: 編碼

# 备注信息
source: Remarks
vi: Thông tin nhận xét
zh_tw: 備註資訊

# 超级管理员
source: Super Administrator
vi: Quản trị viên
zh_tw: 超級管理員

# 查看
source: View
vi: xem
zh_tw: 查看

# 查看参数约束
source: View parameter constraints
vi: Xem các ràng buộc đối số
zh_tw: 查看參數約束

# 编辑模块
source: Edit module
vi: Sửa mô-đun
zh_tw: 編輯模塊

# 新增约束
source: New
vi: Thêm ràng buộc
zh_tw: 新增約束

# 修改约束
source: Modify
vi: Sửa đổi các ràng buộc
zh_tw: 修改約束

# 参数配置
source: Parameter configuration
vi: Cấu hình tham số
zh_tw: 參數配寘

# 新增
source: New
vi: thêm mới
zh_tw: 新增

# 游客
source: Guest
vi: Khách du lịch
zh_tw: 遊客

# 未分配角色
source: No roles assigned
vi: Vai trò chưa gán
zh_tw: 未分配角色

# 验证失败：指定的模块Code '{ModuleCode}' 不存在。
source: Verification failed: The specified module Code '{ModulaCode}' does not exist.
vi: Xác minh không thành công: Mô-đun được chỉ định Code'{ModuleCode}'không tồn tại.
zh_tw: 驗證失敗：指定的模塊Code '{ModuleCode}'不存在。

# 权限验证通过 (直接授权)
source: Permission verification passed (direct authorization)
vi: Giấy phép trực tiếp (Direct Authorization)
zh_tw: 許可權驗證通過（直接授權）

# 权限验证失败。该用户的权限由直接授权列表定义，但此模块未在列表中
source: Permission verification failed. The user's permissions are defined by the direct authorization list, but this module is not in the list
vi: Xác minh quyền không thành công. Quyền của người dùng được xác định bởi danh sách ủy quyền trực tiếp, nhưng mô-đun này không có trong danh sách
zh_tw: 許可權驗證失敗。 該用戶的許可權由直接授權清單定義，但此模塊未在清單中

# 用户 '{UserName}' 未分配任何角色，无权访问。
source: User '{UserName}' has not been assigned any roles and does not have access.
vi: Người dùng'{UserName}'không được gán bất kỳ vai trò nào và không có quyền truy cập.
zh_tw: 用戶'{UserName}'未分配任何角色，無權訪問。

# 模块访问权限验证通过
source: Module access permission verification passed
vi: Module Access Authentication Thông qua
zh_tw: 模塊存取權限驗證通過

# 访问被拒绝。用户权限等级 ({maxUserAuthority}) 低于模块要求等级 ({requiredAuthority})。
source: Access denied. The user permission level ({maxUserAuthority}) is lower than the module requirement level ({demandAuthority}).
vi: Truy cập bị từ chối. Cấp quyền người dùng ({maxUserAuthority}) thấp hơn mức yêu cầu mô-đun ({requiredAuthority}).
zh_tw: 訪問被拒絕。 用戶許可權等級（{maxUserAuthority}）低於模塊要求等級（{requiredAuthority}）。

# 验证失败：操作 '{ActionCode}' 在模块 '{ModuleCode}' 中未定义。
source: Validation failed: Operation '{ActionCode}' is not defined in module '{ModulaCode}'.
vi: Lỗi xác minh: Hành động'{ActionCode}'không được định nghĩa trong mô-đun'{ModuleCode}'.
zh_tw: 驗證失敗：操作'{ActionCode}'在模塊'{ModuleCode}'中未定義。

# 操作权限验证通过 (直接授权)
source: Operation permission verification passed (direct authorization)
vi: Xác minh quyền hoạt động thông qua (ủy quyền trực tiếp)
zh_tw: 操作許可權驗證通過（直接授權）

# 权限验证失败。该用户的权限由直接授权列表定义，但此操作未在列表中
source: Permission verification failed. The user's permissions are defined by the direct authorization list, but this operation is not in the list
vi: Xác minh quyền không thành công. Quyền của người dùng đó được xác định bởi danh sách ủy quyền trực tiếp, nhưng hành động này không có trong danh sách
zh_tw: 許可權驗證失敗。 該用戶的許可權由直接授權清單定義，但此操作未在清單中

# 用户 '{UserName}' 未分配任何角色，无权执行操作。
source: User '{UserName}' has not been assigned any roles and does not have the authority to perform operations.
vi: Người dùng'{UserName}'không được gán bất kỳ vai trò nào và không có quyền thực hiện hành động.
zh_tw: 用戶'{UserName}'未分配任何角色，無權執行操作。

# 操作权限验证通过
source: Operation permission verification passed
vi: Kiểm tra quyền hoạt động Thông qua
zh_tw: 操作許可權驗證通過

# 用户 '{UserName}' 没有对模块ID '{Id}' 执行 '{ActionCode}' 操作的权限。
source: User '{UserName}' does not have permission to perform the '{ActionCode}' operation on module ID '{Id}'.
vi: Người dùng'{UserName}'không có quyền thực hiện thao tác'{ActionCode}' trên ID mô-đun'{Id}'.
zh_tw: 用戶'{UserName}'沒有對模塊ID '{Id}'執行'{ActionCode}'操作的許可權。

# 用户不存在。
source: The user does not exist.
vi: User không tồn tại.
zh_tw: 用戶不存在。

# 密码错误。
source: Password error.
vi: Mật khẩu sai.
zh_tw: 密碼錯誤。

# 用户已被禁用，请联系管理员。
source: The user has been disabled, please contact the administrator.
vi: Người dùng đã bị vô hiệu hóa, vui lòng liên hệ với quản trị viên.
zh_tw: 用戶已被禁用，請聯系管理員。

# 用户 '{UserName}' 成功登录。
source: User '{UserName}' successfully logged in.
vi: Người dùng'{UserName}'đã đăng nhập thành công.
zh_tw: 用戶'{UserName}'成功登入。

# 登录成功
source: Login successful
vi: Đăng nhập thành công
zh_tw: 登入成功

# 用户 '{UserName}' 已注销。
source: User '{UserName}' has been logged out.
vi: Người dùng'{UserName}'đã đăng xuất.
zh_tw: 用戶'{UserName}'已註銷。

# 注销成功
source: Logout successful
vi: Đăng xuất thành công
zh_tw: 註銷成功

# 未找到账户
source: Account not found
vi: Không tìm thấy tài khoản
zh_tw: 未找到帳戶

# 登陆成功
source: Login successful
vi: Hạ cánh thành công
zh_tw: 登入成功

# 用户取消了密码确认。
source: The user cancelled the password confirmation.
vi: Người dùng hủy xác nhận mật khẩu.
zh_tw: 用戶取消了密碼確認。

# 验证失败：权限代码 '{PermissionCode}' 未定义。
source: Verification failed: Permission code '{PermissionCode}' is not defined.
vi: Xác minh không thành công: Mã quyền'{PermissionCode}'không được xác định.
zh_tw: 驗證失敗：許可權程式碼'{PermissionCode}'未定義。

# 限验证失败。该用户的权限由直接授权列表定义，但此操作未在列表中
source: Limit verification failed. The user's permissions are defined by the direct authorization list, but this operation is not in the list
vi: Hạn chế kiểm tra thất bại. Quyền của người dùng đó được xác định bởi danh sách ủy quyền trực tiếp, nhưng hành động này không có trong danh sách
zh_tw: 限驗證失敗。 該用戶的許可權由直接授權清單定義，但此操作未在清單中

# 用户未分配任何角色，无权执行操作。
source: The user has not been assigned any roles and does not have the authority to perform operations.
vi: Người dùng không được giao bất kỳ vai trò nào và không có quyền thực hiện hành động.
zh_tw: 用戶未分配任何角色，無權執行操作。

# 没有执行 '{PermissionCode}' 操作的权限。
source: I do not have permission to perform the '{PermissionCode}' operation.
vi: Không có quyền thực hiện thao tác'{PermissionCode}'.
zh_tw: 沒有執行'{PermissionCode}'操作的許可權。

# 限验证失败, 用户不能为空
source: Verification failed, user cannot be empty
vi: Xác minh giới hạn thất bại, người dùng không thể để trống
zh_tw: 限驗證失敗，用戶不能為空

# 权限验证时发生内部错误: {ErrorMessage}
source: An internal error occurred during permission verification: {Error Message}
vi: Lỗi nội bộ xảy ra khi xác minh quyền: {ErrorMessage}
zh_tw: 許可權驗證時發生內部錯誤：{ErrorMessage}

# 用户取消了切换操作。
source: The user canceled the switching operation.
vi: Bạn hủy bỏ thao tác chuyển đổi.
zh_tw: 用戶取消了切換操作。

# 用户取消了登录。
source: The user has cancelled their login.
vi: Người dùng đã hủy đăng nhập.
zh_tw: 用戶取消了登入。

# 切换失败:{Error}
source: Switching failed: {Error}
vi: Chuyển đổi thất bại: {Error}
zh_tw: 切換失敗：{Error}

# 登录失败:{Error}
source: Login failed: {Error}
vi: Đăng nhập thất bại: {Error}
zh_tw: 登入失敗：{Error}

# 未知错误
source: Unknown error
vi: Lỗi không xác định
zh_tw: 未知錯誤

# 用户切换成功。
source: User switch successful.
vi: User chuyển đổi thành công.
zh_tw: 用戶切換成功。

# 未配置自动登陆参数
source: Automatic login parameters not configured
vi: Tham số hạ cánh tự động chưa được cấu hình
zh_tw: 未配寘自動登陸參數

# 找到已保存的登录信息
source: Find the saved login information
vi: Tìm thông tin đăng nhập đã lưu
zh_tw: 找到已保存的登入資訊

# 未找到任何已保存的登录信息
source: No saved login information found
vi: Không tìm thấy thông tin đăng nhập đã lưu
zh_tw: 未找到任何已保存的登入資訊

# 查找登录信息时出错: {ErrorMessage}
source: Error searching for login information: {Error Message}
vi: Lỗi tìm kiếm thông tin đăng nhập: {ErrorMessage}
zh_tw: 查找登入資訊時出錯：{ErrorMessage}

# 登录信息保存成功。
source: Login information saved successfully.
vi: Thông tin đăng nhập đã được lưu thành công.
zh_tw: 登入資訊保存成功。

# 保存登录信息时出错: {ErrorMessage}
source: Error saving login information: {Error Message}
vi: Gặp lỗi khi lưu thông tin đăng nhập: {ErrorMessage}
zh_tw: 保存登入資訊時出錯：{ErrorMessage}

# 已清除用户的登录信息。
source: User's login information has been cleared.
vi: Thông tin đăng nhập của người dùng đã bị xóa.
zh_tw: 已清除用戶的登入資訊。

# 本地无该用户的登录信息
source: There is no login information for this user locally
vi: Không có thông tin đăng nhập cho người dùng này tại địa phương
zh_tw: 本地無該用戶的登入資訊

# 清除登录信息时出错: {ErrorMessage}
source: Error clearing login information: {Error Message}
vi: Lỗi khi xóa thông tin đăng nhập: {ErrorMessage}
zh_tw: 清除登入資訊時出錯：{ErrorMessage}

# 未找到代码为 '{ModuleCode}' 的模块
source: Module with code '{Modulus Code}' not found
vi: Không tìm thấy mô-đun có mã'{ModuleCode}'
zh_tw: 未找到程式碼為'{ModuleCode}'的模塊

# 查找成功
source: Search successful
vi: Tìm kiếm thành công
zh_tw: 查找成功

# 查找失败,原因：{ErrorMessage}
source: Search failed, reason: {Error Message}
vi: Tìm kiếm thất bại, nguyên nhân: {ErrorMessage}
zh_tw: 查找失敗，原因：{ErrorMessage}

# 获取所有系统模块成功
source: Successfully obtained all system modules
vi: Nhận tất cả các module hệ thống thành công
zh_tw: 獲取所有系統模塊成功

# 获取系统模块失败: {ErrorMessage}
source: Failed to retrieve system module: {Error Message}
vi: Lỗi lấy mô-đun hệ thống: {ErrorMessage}
zh_tw: 獲取系統模塊失敗：{ErrorMessage}

# 批量操作需要编辑模块的权限：{ErrorMessage}
source: Batch operations require permission to edit modules: {Error Message}
vi: Hoạt động hàng loạt yêu cầu quyền chỉnh sửa mô-đun: {ErrorMessage}
zh_tw: 批量操作需要編輯模塊的許可權：{ErrorMessage}

# 没有需要添加的模块
source: There are no modules that need to be added
vi: Không có module cần thêm
zh_tw: 沒有需要添加的模塊

# 模块Code不能为空
source: Module Code cannot be empty
vi: Module code không thể rỗng
zh_tw: 模塊Code不能為空

# 数据库保存失败: {ErrorMessage}
source: Database save failed: {Error Message}
vi: Lỗi lưu cơ sở dữ liệu: {ErrorMessage}
zh_tw: 資料庫保存失敗：{ErrorMessage}

# 批量处理模块失败。成功 0 个，更新 0 个，跳过 {SkippedCount} 个，失败 {FailedCount} 个。
source: Batch processing module failed. 0 successful, 0 updated, {SkippedCount} skipped, {Failed Count} failed.
vi: Mô-đun xử lý hàng loạt thất bại. Thành công 0, cập nhật 0, bỏ qua {SkippedCount} và thất bại {FailedCount}.
zh_tw: 批量處理模塊失敗。 成功0個，更新0個，跳過{SkippedCount}個，失敗{FailedCount}個。

# 所有模块均未发生变化，已全部跳过。
source: All modules have not changed and have been skipped.
vi: Tất cả các mô-đun không thay đổi và tất cả đã bị bỏ qua.
zh_tw: 所有模塊均未發生變化，已全部跳過。

source: Batch processing module completed. Added {SuccessCount}, updated {Updating Count}, skipped {SkippedCount}, and failed {Failed Count}.
vi: Mô-đun xử lý hàng loạt đã hoàn thành. Thêm {SuccessCount}, cập nhật {UpdateCount}, bỏ qua {SkippedCount} và thất bại {FailedCount}.
zh_tw: 批量處理模塊完成。 新增{SuccessCount}個，更新{UpdateCount}個，跳過{SkippedCount}個，失敗{FailedCount}個。

# 新模块添加成功
source: New module added successfully
vi: Module mới được thêm thành công
zh_tw: 新模塊添加成功

# 指定的模块不存在
source: The specified module does not exist
vi: Module không tồn tại
zh_tw: 指定的模塊不存在

# 模块 '{ModuleName}' 的信息已被更新。
source: The information for module '{Modulus Name}' has been updated.
vi: Thông tin về module'{ModuleName}'đã được cập nhật.
zh_tw: 模塊'{ModuleName}'的資訊已被更新。

# 模块信息更新成功
source: Module information updated successfully
vi: Cập nhật thông tin module thành công
zh_tw: 模塊資訊更新成功

# 无法删除模块 '{ModuleName}'，因为它包含子模块
source: Cannot delete module '{ModulaName}' because it contains submodules
vi: Không thể xóa mô-đun'{ModuleName}'vì nó chứa các mô-đun con
zh_tw: 無法删除模塊'{ModuleName}'，因為它包含子模塊

# 无法删除模块 '{ModuleName}'，因为它已关联了权限项
source: Cannot delete module '{ModulaName}' because it is already associated with a permission entry
vi: Không thể xóa mô-đun'{ModuleName}'vì nó đã được liên kết với mục cấp phép
zh_tw: 無法删除模塊'{ModuleName}'，因為它已關聯了許可權項

# 无法删除模块 '{ModuleName}'，因为它已被用户访问权限直接关联
source: Cannot delete module '{ModulaName}' because it is directly associated with user access permissions
vi: Không thể xóa mô-đun'{ModuleName}'vì nó đã được liên kết trực tiếp với quyền truy cập của người dùng
zh_tw: 無法删除模塊'{ModuleName}'，因為它已被用戶存取權限直接關聯

# 模块 '{ModuleName}' (ID: {ModuleId}) 已被删除。
source: Module '{Modulus Name}' (ID: {Modulus Id}) has been deleted.
vi: Mô-đun'{ModuleName}'(ID:{ModuleId}) đã bị xóa.
zh_tw: 模塊'{ModuleName}'（ID: {ModuleId}）已被删除。

# 模块{ModuleName}删除成功
source: Module {ModulaName} deleted successfully
vi: Name
zh_tw: 模塊{ModuleName}删除成功

# 传入的用户不能为空
source: The incoming user cannot be empty
vi: Người dùng không thể để trống
zh_tw: 傳入的用戶不能為空

# 获取授权模块失败: {ErrorMessage}
source: Failed to obtain authorization module: {Error Message}
vi: Mô-đun ủy quyền không thành công: {ErrorMessage}
zh_tw: 獲取授權模塊失敗：{ErrorMessage}

# 模块Code不能为空。
source: Module Code cannot be empty.
vi: Module Code không thể để trống.
zh_tw: 模塊Code不能為空。

# 模块Code '{ModuleCode}' 已存在。
source: Module Code '{ModulaCode}' already exists.
vi: Mô-đun Code'{ModuleCode}'đã tồn tại.
zh_tw: 模塊Code '{ModuleCode}'已存在。

# 模块Code '{ModuleCode}' 已被另一个模块使用。
source: Module Code '{Modulus Code}' is already being used by another module.
vi: Mô-đun Code'{ModuleCode}'đã được sử dụng bởi một mô-đun khác.
zh_tw: 模塊Code '{ModuleCode}'已被另一個模塊使用。

# 用户{UserName}没有模块{ModuleCode}的操作权限
source: User {UserName} does not have operational permissions for Module {ModulaCode}
vi: Người dùng {UserName} không có quyền hoạt động cho mô-đun {ModuleCode}
zh_tw: 用戶{UserName}沒有模塊{ModuleCode}的操作許可權

# 未登录
source: Not logged in
vi: chưa đăng nhập
zh_tw: 未登錄

# 未找到{ModuleCode}对应的模块
source: Module not found for {Modulus Code}
vi: Không tìm thấy mô-đun tương ứng {ModuleCode}
zh_tw: 未找到{ModuleCode}對應的模塊

# 操作成功
source: Operation successful
vi: Thao tác thành công
zh_tw: 操作成功

# 编码{ModuleCode} 模块不存在，无法配置参数
source: Encoding {Modulus Code} module does not exist, unable to configure parameters
vi: Mô-đun mã hóa {ModuleCode} không tồn tại và không thể cấu hình các tham số
zh_tw: 編碼{ModuleCode}模塊不存在，無法配寘參數

# 取消参数配置
source: Cancel parameter configuration
vi: Hủy cấu hình tham số
zh_tw: 取消參數配寘

# 编码{ModuleCode} 模块配置参数完成
source: Encoding {Modulus Code} module configuration parameters completed
vi: Mã hóa {ModuleCode} Tham số cấu hình mô-đun đã hoàn thành
zh_tw: 編碼{ModuleCode}模塊配寘參數完成

# 参数配置出现未知错误，请联系管理人员
source: Unknown error in parameter configuration, please contact management personnel
vi: Gặp lỗi không xác định cấu hình tham số, vui lòng liên hệ với quản lý
zh_tw: 參數配寘出現未知錯誤，請聯系管理人員

# 查找参数并赋值失败，具体看Failed
source: Failed to search for parameters and assign values, please refer to Failed for details
vi: Tìm tham số và gán giá trị thất bại, cụ thể là Failed
zh_tw: 查找參數並賦值失敗，具體看Failed

# 更新{ParameterCode}属性值失败
source: Failed to update {ParameterCode} property value
vi: Cập nhật {ParameterCode} giá trị thuộc tính không thành công
zh_tw: 更新{ParameterCode}屬性值失敗

# 更新{ParameterCode}属性值失败,原因:{Reason}
source: Updating {ParameterCode} property value failed, reason: {Reason}
vi: Cập nhật {ParameterCode} giá trị thuộc tính không thành công, lý do: {Reason}
zh_tw: 更新{ParameterCode}屬性值失敗，原因：{Reason}

# 该角色已配置了此参数的权限，无法重复添加
source: The role has already been configured with permission for this parameter and cannot be added again
vi: Vai trò đã được cấu hình quyền cho tham số này và không thể thêm lại
zh_tw: 該角色已配寘了此參數的許可權，無法重複添加

# 参数权限添加成功
source: Parameter permission added successfully
vi: Thêm quyền tham số thành công
zh_tw: 參數許可權添加成功

# 添加参数权限失败: {ErrorMessage}
source: Failed to add parameter permission: {Error Message}
vi: Thêm quyền tham số không thành công: {ErrorMessage}
zh_tw: 添加參數許可權失敗：{ErrorMessage}

# 要删除的权限记录不存在
source: The permission record to be deleted does not exist
vi: Bản ghi quyền cần xóa không tồn tại
zh_tw: 要删除的許可權記錄不存在

# 删除参数权限失败: {ErrorMessage}
source: Failed to delete parameter permission: {Error Message}
vi: Quyền xóa tham số không thành công: {ErrorMessage}
zh_tw: 删除參數許可權失敗：{ErrorMessage}

# 权限码 '{ParameterCode}' 已存在，不能重复
source: The permission code '{ParameterCode}' already exists and cannot be duplicated
vi: Mã quyền'{ParameterCode}'đã tồn tại và không thể lặp lại
zh_tw: 許可權碼'{ParameterCode}'已存在，不能重複

# 权限创建成功
source: Permission creation successful
vi: Tạo quyền thành công
zh_tw: 許可權創建成功

# 创建权限失败: {ErrorMessage}
source: Failed to create permission: {Error Message}
vi: Lỗi tạo quyền: {ErrorMessage}
zh_tw: 創建許可權失敗：{ErrorMessage}

# 要更新的权限不存在
source: The permission to be updated does not exist
vi: Quyền cập nhật không tồn tại
zh_tw: 要更新的許可權不存在

# 权限码 '{ParameterCode}' 已被其他权限占用。
source: The permission code '{ParameterCode}' is already occupied by another permission.
vi: Mã quyền'{ParameterCode}'đã bị chiếm bởi các quyền khác.
zh_tw: 許可權碼'{ParameterCode}'已被其他許可權佔用。

# 更新了权限 '{ParameterName}' (Code: {ParameterCode}).
source: Updated permission '{ParameterName}' (Code: {ParameterCode})
vi: Cập nhật quyền'{ParameterName}'(Code:{ParameterCode}).
zh_tw: 更新了許可權'{ParameterName}'（Code: {ParameterCode}）.

# 权限更新成功
source: Permission update successful
vi: Cập nhật quyền thành công
zh_tw: 許可權更新成功

# 权限更新失败: {ErrorMessage}
source: Permission update failed: {Error Message}
vi: Cập nhật quyền không thành công: {ErrorMessage}
zh_tw: 許可權更新失敗：{ErrorMessage}

# 要删除的权限不存在
source: The permission to be deleted does not exist
vi: Quyền được xóa không tồn tại
zh_tw: 要删除的許可權不存在

# 无法删除权限 '{ParameterName}'，因为它已被分配给一个或多个角色。请先从所有角色中移除此权限。
source: The permission '{ParameterName}' cannot be deleted because it has been assigned to one or more roles. Please remove this permission from all roles first.
vi: Quyền'{ParameterName}'không thể bị xóa vì nó đã được gán cho một hoặc nhiều vai trò. Trước tiên, hãy loại bỏ quyền này khỏi tất cả các vai trò của bạn.
zh_tw: 無法删除許可權'{ParameterName}'，因為它已被分配給一個或多個角色。 請先從所有角色中移除此許可權。

# 删除权限 '{ParameterName}' (Code: {ParameterCode}).
source: Delete permission '{ParameterName}' (Code: {ParameterCode})
vi: Bỏ quyền truy cập'{ParameterName}'(Code:{ParameterCode}).
zh_tw: 删除許可權'{ParameterName}'（Code: {ParameterCode}）.

# 权限删除成功
source: Permission deleted successfully
vi: Xóa quyền thành công
zh_tw: 許可權删除成功

# 权限删除失败: {ErrorMessage}
source: Permission deletion failed: {Error Message}
vi: Lỗi xóa quyền: {ErrorMessage}
zh_tw: 許可權删除失敗：{ErrorMessage}
