Repository: lihongxu0221/Toolkit
Catalog: Toolkit/BgCommon.Localization/Assets/Localization/Translations.*.resx
Languages: vi, zh_tw

# 数据加载失败，请稍后重试，原因：{Message}
source: Data loading failed, please try again later, reason: {Message}
vi: Tải dữ liệu không thành công, vui lòng thử lại sau, lý do: {Message}
zh_tw: 數據加載失敗，請稍後重試，原因：{Message}

# 请先选中要删除的项
source: Please select the item to be deleted first
vi: Vui lòng chọn mục bạn muốn xóa trước
zh_tw: 請先選中要删除的項

# 请先选中要创建子节点的项
source: Please select the item to create child nodes first
vi: Trước tiên, hãy chọn mục mà bạn muốn tạo nút con.
zh_tw: 請先選中要創建子節點的項

# 请先选中要编辑的项
source: Please select the item to be edited first
vi: Vui lòng chọn mục bạn muốn chỉnh sửa trước
zh_tw: 請先選中要編輯的項

# 无法找到创建视图对应的模块，请联系管理员
source: Unable to find the module corresponding to creating the view, please contact the administrator
vi: Không thể tìm thấy mô-đun tương ứng để tạo dạng xem, vui lòng liên hệ với quản trị viên
zh_tw: 無法找到創建視圖對應的模塊，請聯系管理員

# 创建成功
source: Created successfully
vi: Tạo thành công
zh_tw: 創建成功

# 更新成功
source: Update successful
vi: Cập nhật thành công
zh_tw: 更新成功

# 保存失败: {Message}
source: Save failed: {Message}
vi: Lưu không thành công: {Message}
zh_tw: 保存失敗：{Message}

# 请先选择一个实体
source: Please select an entity first
vi: Vui lòng chọn Entity trước
zh_tw: 請先選擇一個實體

# 确定要删除吗?
source: Are you sure you want to delete it?
vi: Bạn chắc chắn muốn xóa?
zh_tw: 確定要删除嗎？

# 删除成功
source: Deleted successfully
vi: Xóa thành công
zh_tw: 删除成功

# 删除失败: {Message}
source: Delete failed: {Message}
vi: Lỗi xóa: {Message}
zh_tw: 删除失敗：{Message}

# 数据验证失败，请修正以下错误：{NewLine}{Errors}
source: Data validation failed, please correct the following errors: {NewLine} {Errors}
vi: Xác thực dữ liệu không thành công, vui lòng sửa lỗi sau: {NewLine}{Errors}
zh_tw: 數據驗證失敗，請修正以下錯誤：{NewLine}{Errors}

# 正在加载，请稍候...
source: Loading, please wait ..
vi: Đang tải, vui lòng đợi. ..
zh_tw: 正在加載，請稍候. ..

# 导航到 {ViewName} 失败，原因未知
source: Navigation to {ViewName} failed, reason unknown
vi: Điều hướng đến {ViewName} không thành công, không rõ lý do
zh_tw: 導航到{ViewName}失敗，原因未知

# 扫描完成
source: Scan completed
vi: Quét xong
zh_tw: 掃描完成

# [数据库同步]
source: [Database synchronization]
vi: [Đồng bộ hóa cơ sở dữ liệu]
zh_tw: [資料庫同步]

# 正在同步数据库初始数据...
source: Syncing initial database data ..
vi: Đồng bộ hóa dữ liệu ban đầu của cơ sở dữ liệu. ..
zh_tw: 正在同步資料庫初始數據. ..

# 数据库初始数据同步失败
source: Initial database data synchronization failed
vi: Lỗi đồng bộ dữ liệu ban đầu của cơ sở dữ liệu
zh_tw: 資料庫初始資料同步失敗

# 数据库初始数据同步完成 , 耗时 {Milliseconds} ms
source: The initial data synchronization of the database is completed, taking {Milliseconds} ms
vi: Đồng bộ hóa dữ liệu ban đầu của cơ sở dữ liệu hoàn tất, tốn thời gian {Milliseconds} ms
zh_tw: 資料庫初始資料同步完成，耗時{Milliseconds} ms

# 数据库初始化失败: {Message} , 耗时 {Milliseconds} ms
source: Database initialization failed: {Message}, took {Milliseconds} ms
vi: Lỗi khởi tạo cơ sở dữ liệu: {Message}, tốn thời gian {Milliseconds} ms
zh_tw: 資料庫初始化失敗：{Message}，耗時{Milliseconds} ms

# [初始化]
source: [Initialization]
vi: [Khởi tạo]
zh_tw: [初始化]

# 开始基础初始化...
source: Start basic initialization ..
vi: Bắt đầu khởi tạo nền tảng. ..
zh_tw: 開始基礎初始化. ..

# 权限系统初始化完成，耗时 {Milliseconds} ms
source: The initialization of the permission system has been completed, taking {Milliseconds} ms
vi: Khởi tạo hệ thống quyền hoàn tất, tốn thời gian {Milliseconds} ms
zh_tw: 許可權系統初始化完成，耗時{Milliseconds} ms

# 应用初始化完成...
source: Application initialization completed ..
vi: Áp dụng khởi tạo hoàn tất. ..
zh_tw: 應用初始化完成. ..

# [用户认证]
source: [User authentication]
vi: [Xác thực người dùng]
zh_tw: [用戶認證]

# 正在检查自动登录信息...
source: Checking automatic login information ..
vi: Kiểm tra thông tin đăng nhập tự động. ..
zh_tw: 正在檢查自動登錄資訊. ..

# 用户 '{UserName}' 自动登录完成...
source: User '{UserName}' has completed automatic login ..
vi: Người dùng'{UserName}'tự động đăng nhập hoàn tất. ..
zh_tw: 用戶'{UserName}'自動登錄完成. ..

# [加载模块]
source: [Loading Module]
vi: [Tải mô-đun]
zh_tw: [加載模塊]

# 正在动态注入视图...
source: Dynamically injecting views ..
vi: Đang tiêm một hình chiếu động. ..
zh_tw: 正在動態注入視圖. ..

# 开始加载模块...
source: Start loading module ..
vi: Bắt đầu tải module. ..
zh_tw: 開始加載模塊. ..

# 加载模块：{ModuleName}
source: Loading module: {Modulus Name}
vi: Name
zh_tw: 加載模塊：{ModuleName}

# [应用程序数据]
source: [Application Data]
vi: [Dữ liệu ứng dụng]
zh_tw: [應用程序數據]

# 开始载入应用程序数据...
source: Start loading application data ..
vi: Bắt đầu tải dữ liệu ứng dụng. ..
zh_tw: 開始載入應用程序數據. ..

# [初始化完成]
source: [Initialization completed]
vi: [Khởi tạo xong]
zh_tw: [初始化完成]

# 初始化完成
source: Initialization completed
vi: Khởi tạo xong
zh_tw: 初始化完成

# 应用程序初始化失败: {Message}
source: Application initialization failed: {Message}
vi: Lỗi khởi tạo ứng dụng: {Message}
zh_tw: 應用程序初始化失敗：{Message}

# [加载出错]
source: [Loading error]
vi: [Tải lỗi]
zh_tw: [加載出錯]

# 集合编辑
source: Collection Editing
vi: Bộ sưu tập Edit
zh_tw: 集合編輯

# 此电脑
source: This PC
vi: Máy tính này
zh_tw: 此電腦

# 文件夹
source: Folder
vi: Thư mục
zh_tw: 資料夾

# 驱动器
source: Drive
vi: ổ đĩa
zh_tw: 驅動器

# 文件
source: File
vi: tài liệu
zh_tw: 文件

# 执行
source: Execute
vi: thực hiện
zh_tw: 執行

# 杂项
source: Misc
vi: Linh tinh
zh_tw: 雜項

# 正在以操作员模式启动...
source: Starting in operator mode ..
vi: Khởi động ở chế độ điều khiển. ..
zh_tw: 正在以操作員模式啟動. ..

# 操作员模式启动失败: {Message}
source: Operator mode startup failed: {Message}
vi: Lỗi khởi động chế độ nhà điều hành: {Message}
zh_tw: 操作員模式啟動失敗：{Message}

# 监控服务已在运行中
source: The monitoring service is already running
vi: Dịch vụ giám sát đang hoạt động
zh_tw: 監控服務已在運行中

# 监控服务已成功启动
source: The monitoring service has been successfully started
vi: Dịch vụ giám sát đã được khởi chạy thành công
zh_tw: 監控服務已成功啟動

# 监控服务未运行
source: The monitoring service is not running
vi: Dịch vụ giám sát không hoạt động
zh_tw: 監控服務未運行

# 监控服务已成功停止
source: The monitoring service has been successfully stopped
vi: Dịch vụ giám sát đã dừng thành công
zh_tw: 監控服務已成功停止

# 监控服务尚未启动，请先调用 StartAsync
source: The monitoring service has not been started yet, please call StartAsynchronous first
vi: Dịch vụ giám sát chưa bắt đầu, hãy gọi StartAsync trước
zh_tw: 監控服務尚未啟動，請先調用StartAsync

# 已开启 {Target} 监控
source: {Target} monitoring has been enabled
vi: Đã bật {mục tiêu} giám sát
zh_tw: 已開啟{Target}監控

# 未登陆
source: Not logged in
vi: Không hạ cánh
zh_tw: 未登陸

# 确认密码
source: Confirm Password
vi: Xác nhận mật khẩu
zh_tw: 確認密碼

# 功能暂未实现
source: Function not yet implemented
vi: Chức năng chưa thực hiện
zh_tw: 功能暫未實現

# 重试
source: Retry
vi: Thử lại
zh_tw: 重試

# 详细信息
source: Details
vi: Chi tiết
zh_tw: 詳細資訊

# 功能正在加载中
source: The function is loading
vi: Chức năng đang tải
zh_tw: 功能正在加載中

# 程序集列表
source: Assembly List
vi: Danh sách assembly
zh_tw: 程式集清單

# 从文件加载
source: Load from file
vi: Tải từ tập tin
zh_tw: 從檔案加載

# 从文件夹加载
source: Load from folder
vi: Đang tải từ thư mục
zh_tw: 從資料夾加載

# 启用
source: Enable
vi: kích hoạt
zh_tw: 啟用

# 插件名称
source: Plugin Name
vi: Bổ sung tên
zh_tw: 挿件名稱

# 完整类名
source: Complete class name
vi: Tên lớp đầy đủ
zh_tw: 完整類名

# 所在程序集
source: The assembly where it is located
vi: assembly trong đó
zh_tw: 所在程式集

# 日志来源
source: Log source
vi: Nguồn nhật ký
zh_tw: 日誌來源

# 级别
source: Level
vi: cấp độ
zh_tw: 級別

# 开始时间
source: Start time
vi: thời gian bắt đầu
zh_tw: 開始時間

# 结束时间
source: End time
vi: Thời gian kết thúc
zh_tw: 結束時間

# 查询.
source: Search
vi: Truy vấn.
zh_tw: 査詢.

# 编号
source: NO.
vi: số hiệu
zh_tw: 編號

# 时间戳
source: Timestamp
vi: Dấu thời gian
zh_tw: 時間戳記

# 日志信息
source: Log information
vi: Thông tin đăng nhập
zh_tw: 日誌資訊

# 异常信息
source: Exception message
vi: Thông tin bất thường
zh_tw: 异常資訊

# 实时日志条数
source: Number of real-time logs
vi: Số lượng thanh ghi trực tiếp
zh_tw: 實时日誌條數

# 最长存储时间
source: Maximum storage time
vi: Thời gian lưu trữ tối đa
zh_tw: 最長存儲時間

# 重置
source: Reset
vi: Đặt lại
zh_tw: 重置

# 保存
source: Save
vi: lưu
zh_tw: 保存

# 消息
source: Message
vi: tin tức
zh_tw: 消息

# 上一条
source: Previous
vi: Bài viết trước
zh_tw: 上一條

# 下一条
source: Next
vi: Tiếp theo
zh_tw: 下一條

# 关闭
source: Close
vi: đóng
zh_tw: 關閉

# 数据来源
source: Data source
vi: Nguồn dữ liệu
zh_tw: 數據來源

# 历史日志
source: Historical log
vi: Lịch sử
zh_tw: 歷史日誌

# 测试
source: Test
vi: kiểm tra
zh_tw: 測試

# 清除实时
source: Clear real-time
vi: Xóa thời gian thực
zh_tw: 清除實时

# 日志数据源参数设置
source: Parameter settings for log data source
vi: Cài đặt tham số nguồn dữ liệu nhật ký
zh_tw: 日誌資料來源參數設置

# 时间
source: Time
vi: thời gian
zh_tw: 時間

# 来源
source: Source
vi: Nguồn
zh_tw: 來源

# 信息
source: Information
vi: thông tin
zh_tw: 訊息

# 所属参数
source: Belonging parameters
vi: Tham số sở hữu
zh_tw: 所屬參數

# 约束类型
source: Constraint type
vi: Loại Constraint
zh_tw: 約束類型

# 增加约束
source: Add constraints
vi: Tăng ràng buộc
zh_tw: 新增約束

# 删除约束
source: Remove constraint
vi: Xoá ràng buộc
zh_tw: 删除約束

# 约束值
source: Constraint value
vi: Giá trị ràng buộc
zh_tw: 約束值

# 描述
source: Description
vi: mô tả
zh_tw: 描述

# 所有参数列表
source: All parameter lists
vi: Danh sách tất cả các tham số
zh_tw: 所有參數列表

# 模块参数配置列表
source: Module parameter configuration list
vi: Danh sách cấu hình tham số mô-đun
zh_tw: 模塊參數配寘清單

# 参数约束管理
source: Parameter constraint management
vi: Quản lý ràng buộc tham số
zh_tw: 參數約束管理

# 设置最低显示权限
source: Set minimum display permission
vi: Đặt quyền hiển thị tối thiểu
zh_tw: 設定最低顯示許可權

# 设置最低编辑权限
source: Set minimum editing permissions
vi: Đặt quyền chỉnh sửa tối thiểu
zh_tw: 設定最低編輯許可權

# 最低显示权限
source: Minimum display permission
vi: Quyền hiển thị tối thiểu
zh_tw: 最低顯示許可權

# 最低编辑权限
source: Minimum editing permission
vi: Quyền chỉnh sửa tối thiểu
zh_tw: 最低編輯許可權

# 类型
source: Type
vi: loại
zh_tw: 類型

# 显示名称
source: Display Name
vi: Hiện tên
zh_tw: 顯示名稱

# 分类
source: Classification
vi: phân loại
zh_tw: 分類

# 步长
source: Increment
vi: Bước chân
zh_tw: 步長

# 小数位数
source: DecimalPlaces
vi: Số thập phân
zh_tw: 小數位數

# 参数当前值
source: Current value of parameter
vi: Tham số Giá trị hiện tại
zh_tw: 參數當前值

# 管理
source: Management
vi: quản lý
zh_tw: 管理

# 参数值
source: Parameter value
vi: Giá trị tham số
zh_tw: 參數值

# 创建人
source: Creator
vi: người tạo
zh_tw: 創建人

# 修改人
source: Modifier
vi: người sửa đổi
zh_tw: 修改人

# 左区域
source: Left area
vi: Khu vực trái
zh_tw: 左區域

# 右区域
source: Right area
vi: Khu vực bên phải
zh_tw: 右區域

# 启动
source: Start
vi: khởi động
zh_tw: 啟動

# 暂停
source: Pause
vi: Tạm dừng
zh_tw: 暫停

# 停止
source: Stop
vi: dừng lại
zh_tw: 停止

# 开始阀标定
source: Start valve calibration
vi: Bắt đầu đánh dấu van
zh_tw: 開始閥標定

# 停止阀标定
source: Stop valve calibration
vi: Tiêu chuẩn van dừng
zh_tw: 停止閥標定

# 最小值约束(数值或日期)
source: Minimum value constraint (numerical or date)
vi: Hạn chế tối thiểu (giá trị số hoặc ngày)
zh_tw: 最小值約束（數值或日期）

# 最大值约束(数值或日期)
source: Maximum value constraint (numerical or date)
vi: Hạn chế tối đa (giá trị số hoặc ngày)
zh_tw: 最大值約束（數值或日期）

# 正则表达式
source: Regular expression
vi: Biểu thức chính quy
zh_tw: 規則運算式

# 下拉列表数据源
source: Dropdown list data source
vi: Nguồn dữ liệu danh sách thả xuống
zh_tw: 下拉清單資料來源

# 字符串的最大长度
source: The maximum length of a string
vi: Độ dài tối đa của chuỗi
zh_tw: 字串的最大長度

# 小数点位数
source: Number of decimal places
vi: Số thập phân
zh_tw: 小數點位數

# 字符串
source: String
vi: Chuỗi
zh_tw: 字串

# 长整数
source: Long integer
vi: Số nguyên dài
zh_tw: 長整數

# 整数
source: Integer
vi: Số nguyên
zh_tw: 整數

# 短整数
source: Short integer
vi: Số nguyên ngắn
zh_tw: 短整數

# 字节
source: Byte
zh_tw: 位元組

# 双精度浮点数
source: Double precision floating-point number
vi: Số float chính xác gấp đôi
zh_tw: 雙精度浮點數

# 单精度浮点数
source: Single-precision floating-point
vi: Số float chính xác đơn
zh_tw: 單精度浮點數

# 枚举
source: Enumeration
vi: Danh sách
zh_tw: 枚舉

# 布尔值
source: Boolean value
vi: Giá trị Boolean
zh_tw: 布林值

# 时间日期
source: Date
vi: Ngày giờ
zh_tw: 時間日期

# 坐标点位
source: Coordinate point
vi: các vị trí tọa độ
zh_tw: 座標點比特

# 数组
source: Array
vi: Mảng
zh_tw: 數組

# 集合
source: Collection
vi: Tập hợp
zh_tw: 集合

# 模块
source: Module
vi: mô-đun
zh_tw: 模塊

# 功能
source: Function
vi: chức năng
zh_tw: 功能

# 查询
source: Query
vi: truy vấn
zh_tw: 査詢

# 创建
source: Create
vi: tạo
zh_tw: 創建

# 更新
source: Update
vi: cập nhật
zh_tw: 更新

# 新建
source: New
vi: Mới
zh_tw: 新建

# 复制
source: Copy
vi: sao chép
zh_tw: 複製

# 重命名
source: Rename
vi: đổi tên
zh_tw: 重命名

# 导入
source: Import
vi: nhập khẩu
zh_tw: 導入

# 导出
source: Export
vi: Xuất
zh_tw: 匯出

# 打印
source: Print
vi: in
zh_tw: 列印

# 从不
source: Never
vi: Không bao giờ
zh_tw: 從不

# 获得焦点时
source: When gaining focus
vi: Khi tập trung
zh_tw: 獲得焦點時

# 左侧标题
source: Left side title
vi: Tiêu đề trái
zh_tw: 左側標題

# 上方标题
source: Title above
vi: Tiêu đề trên
zh_tw: 上方標題

# 标题隐藏
source: Title hidden
vi: Tiêu đề Ẩn
zh_tw: 標題隱藏

# 标题折叠
source: Title folding
vi: Gấp tiêu đề
zh_tw: 標題折疊

# 左
source: Left
vi: trái
zh_tw: 左

# 居中
source: Center
vi: Ở giữa
zh_tw: 居中

# 右
source: Right
vi: phải
zh_tw: 右

# 水平方向
source: horizontal direction
vi: Hướng ngang
zh_tw: 水准方向

# 垂直方向
source: VerticalDirection
vi: Hướng dọc
zh_tw: 垂直方向

# 纯文本
source: Plain text
vi: Văn bản thuần
zh_tw: 純文字

# 文本只读
source: Text read-only
vi: Văn bản chỉ đọc
zh_tw: 文字只讀

# 字节(无符号)
source: Byte (unsigned)
vi: Byte (không dấu)
zh_tw: 位元組（無符號）

# 短整数(无符号)
source: Short integer (unsigned)
vi: Số nguyên ngắn (unsigned)
zh_tw: 短整數（無符號）

# 整数(无符号)
source: Integer (unsigned)
vi: Số nguyên (unsigned)
zh_tw: 整數（無符號）

# 长整数(无符号)
source: Long integer (unsigned)
vi: Số nguyên dài (unsigned)
zh_tw: 長整數（無符號）

# 水平对齐
source: horizontal alignment
vi: Căn ngang
zh_tw: 水准對齊

# 垂直对齐
source: VerticalAlignment
vi: Canh lề dọc
zh_tw: 垂直對齊

# 图像源
source: Image source
vi: Nguồn ảnh
zh_tw: 影像源

# 列表
source: List
vi: Danh sách
zh_tw: 清單

# 获得焦点时生效
source: Effective upon gaining focus
vi: Có hiệu lực khi lấy nét
zh_tw: 獲得焦點時生效

# 获得焦点且鼠标悬停时生效
source: Effective when gaining focus and hovering the mouse
vi: Lấy nét và có hiệu lực khi di chuột
zh_tw: 獲得焦點且滑鼠懸停時生效

# 鼠标悬停时生效
source: Effective when hovering over the mouse
vi: Hiệu lực khi di chuột
zh_tw: 滑鼠懸停時生效

# 禁用鼠标滚轮
source: Disable mouse scroll wheel
vi: Vô hiệu hóa bánh xe chuột
zh_tw: 禁用滑鼠滾輪

# 深色
source: Dark
vi: Tối
zh_tw: 深色

# 浅色
source: Light
vi: Màu sáng
zh_tw: 淺色

# 运行日志
source: Running
vi: Nhật ký chạy
zh_tw: 運行日誌

# 弹窗日志
source: Popup log
vi: Đăng nhập cửa sổ
zh_tw: 彈窗日誌

# 视觉日志
source: Vision log
vi: Nhật ký hình ảnh
zh_tw: 視覺日誌

# 运控日志
source: Operation control log
vi: Nhật ký vận chuyển
zh_tw: 運控日誌

# 硬件日志
source: Hardware
vi: Nhật ký phần cứng
zh_tw: 硬體日誌

# 生产日志
source: Production
vi: Nhật ký sản xuất
zh_tw: 生產日誌

# MES日志
source: MES log
vi: Nhật ký MES
zh_tw: MES日誌

# 数据库日志
source: Database logs
vi: Nhật ký cơ sở dữ liệu
zh_tw: 資料庫日誌

# 未定义
source: Undefined
vi: Chưa xác định
zh_tw: 未定義

# 无监控对象
source: No monitoring object
vi: Không có đối tượng giám sát
zh_tw: 無監控對象

# 进程状态
source: Process status
vi: Trạng thái tiến trình
zh_tw: 行程狀態

# 设备状态
source: Device Status
vi: Trạng thái thiết bị
zh_tw: 設備狀態

# 运行状态
source: Operating status
vi: trạng thái hoạt động
zh_tw: 運行狀態

# 监控所有
source: All
vi: Giám sát tất cả
zh_tw: 監控所有

# 名称
source: Name
zh_tw: 名稱

# 修改时间
source: modification time
zh_tw: 修改時間

# 修改日期
source: modified date
zh_tw: 修改日期

# 桌面
source: Desktop
zh_tw: 案頭

# 文档
source: Document
zh_tw: 檔案

# 下载
source: Download
zh_tw: 下載

# 音乐
source: Music
zh_tw: 音樂

# 图片
source: Picture
zh_tw: 圖片

# 视频
source: Video
zh_tw: 視頻

# 大小
source: Size
zh_tw: 大小
